app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("name", "encrypted_password", "salt", "created_at", "updated_at", "remember_token", "email") VALUES('nirmal', 'd3c295059ad534d03d4b3f42789c228198127690f34c72a3effdbfde857ec235', '9b337f9305a9db8ab87a2148b9593d3fd45d89daaf0748ea9928d1fc6eb51970', '2011-06-10 04:24:21', '2011-06-10 04:24:21', NULL, 'LBNNIRMAL@GMAIL.COM')

  def index
    @title = "All users"
    @users = User.paginate(:page => params[:page])
---
SELECT * FROM "users" LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "users"

  def destroy
    User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "id" = 23
SELECT * FROM "users" WHERE ("users"."id" = 23)